/****************************************************************************/
/*                                                                          */
/*              LCD                                                         */
/*                                                                          */
/*              2014年07月29日                                              */
/*                                                                          */
/****************************************************************************/
#ifndef _LCD_H_
#define _LCD_H_

#include "soc_C6748.h"

#include "raster.h"

/****************************************************************************/
/*                                                                          */
/*              宏定义                                                      */
/*                                                                          */
/****************************************************************************/
// LCD 时钟
#define LCD_CLK                 228000000

// LCD 分辨率
#define LCD_WIDTH               800
#define LCD_HEIGHT              480

// 调色板
#define PALETTE_SIZE            32
#define PALETTE_OFFSET          4

extern unsigned char g_pucBuffer[2][4 + (16 * 2) + (LCD_WIDTH * LCD_HEIGHT *2)];

/****************************************************************************/
/*                                                                          */
/*              函数声明                                                    */
/*                                                                          */
/****************************************************************************/
void LCDInit(void);
void LCDBacklightEnable(void);
void LCDBacklightDisable(void);

#endif
